Code/Analysis/data/M16_1_5e12/0.orig/CAir
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format binary;
 class volScalarField;
 location "0";
 object CAir;
}

dimensions [ 0 0 0 0 0 0 0 ];

internalField uniform 0;

boundaryField
{
  top
  {
    type zeroGradient;
  }
  wall
  {
    type outOfEquilibriumPhaseContactAngle; //equilibriumPhaseContactAngle
    thetaProperties
    (
      (water air) 15 0 0 0
    );
    Gamma 1.5e12;
    linearisationMethod none;
    alpha 500 {1.0};
    beta 1;
    limit none;
    value uniform 0; 	//type            zeroGradient;
  }
  bottom
  {
    type zeroGradient;
  }
  axis
  {
    type empty;
  }
  front
  {
    type wedge;
  }
  back
  {
    type wedge;
  }
} 	// ************************************************************************* //

